app/Controllers/Acara.php

SELECT *
FROM `acara`
---
    public function index()
    {

        $builder = $this->db->table('acara');
        $query   = $builder->get()->getResult();

SELECT *
FROM `acara`
WHERE `id_acara` = '1'
---
    public function edit($id = null){
       if($id !=null) {

        $query = $this->db->table('acara')->getWhere(['id_acara' =>$id]);